; domain
(define (domain a2-grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
			(key-color ?k ?c)
			(box-color ?b ?c)
			(at ?r ?x )
			(at-agent ?x)
			(place ?p)
			(key ?k)
			(color ?c)
			(box ?b)
			(locked ?b)
			(open ?b)
			(holding ?k ?h)
			(hand ?h)
			(handfree ?h))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
			(at-agent ?curpos) (conn ?curpos ?nextpos))
:effect (and (at-agent ?nextpos) (not(at-agent ?curpos))))


(:action pickup
:parameters (?curpos ?key ?hand)
:precondition (and (place ?curpos) (key ?key) (hand ?hand)
			(at-agent ?curpos) (at ?key ?curpos) (handfree ?hand))
:effect (and (holding ?key ?hand) (not (at ?key ?curpos)) (not (handfree ?hand)) )
)

(:action drop
:parameters (?curpos ?key ?hand)
:precondition (and (place ?curpos) (key ?key) (hand ?hand)
				(at-agent ?curpos) (holding ?key ?hand))
:effect (and (at ?key ?curpos)  (handfree ?hand)  (not (holding ?key ?hand)))
)

(:action unlock
:parameters (?curpos ?key ?box ?color ?hand)
:precondition ( and (place ?curpos) (key ?key) (box ?box) (color ?color) (hand ?hand)
				(key-color ?key ?color) (box-color ?box ?color)
				(at-agent ?curpos) (at ?box ?curpos) (locked ?box) (holding ?key ?hand))
				
:effect (and (handfree ?hand) (not (holding ?key ?hand)) (open ?box) (not (locked ?box)))
)

)

; problem
(define (problem grid4x4_2k)
(:domain a2-grid)
(:objects 	node0-0 node0-1 node0-2 node0-3
		node1-0 node1-1 node1-2 node1-3
		node2-0 node2-1 node2-2 node2-3
		node3-0 node3-1 node3-2 node3-3
		box0 box1 key0 key1
		red green
		hand0 hand1)

(:init (place node0-0) (place node0-1) (place node0-2) (place node0-3)
	(place node1-0) (place node1-1) (place node1-2) (place node1-3)
	(place node2-0) (place node2-1) (place node2-2) (place node2-3)
	(place node3-0) (place node3-1) (place node3-2) (place node3-3)
	(conn node0-0 node1-0) (conn node0-0 node0-1)
	(conn node0-1 node0-0) (conn node0-1 node1-1) (conn node0-1 node0-2)
	(conn node0-2 node0-1) (conn node0-2 node1-2) (conn node0-2 node0-3)
	(conn node0-3 node0-2) (conn node0-3 node1-3)
	(conn node1-0 node0-0) (conn node1-0 node1-1) (conn node1-0 node2-0)
	(conn node1-1 node0-1) (conn node1-1 node1-0) (conn node1-1 node2-1) (conn node1-1 node1-2)
	(conn node1-2 node0-2) (conn node1-2 node1-1) (conn node1-2 node2-2) (conn node1-2 node1-3)
	(conn node1-3 node0-3) (conn node1-3 node1-2) (conn node1-3 node2-3)
	(conn node2-0 node1-0) (conn node2-0 node2-1) (conn node2-0 node3-0)
	(conn node2-1 node1-1) (conn node2-1 node2-0) (conn node2-1 node3-1) (conn node2-1 node2-2)
	(conn node2-2 node1-2) (conn node2-2 node2-1) (conn node2-2 node3-2) (conn node2-2 node2-3)
	(conn node2-3 node1-3) (conn node2-3 node2-2) (conn node2-3 node3-3)
	(conn node3-0 node2-0) (conn node3-0 node3-1) 
	(conn node3-1 node2-1) (conn node3-1 node3-0) (conn node3-1 node3-2)
	(conn node3-2 node2-2) (conn node3-2 node3-1) (conn node3-2 node3-3)
	(conn node3-3 node2-3) (conn node3-3 node3-2)
	(color red) (color green)
	(box box0) (at box0 node1-1) (locked box0) (box-color box0 red)
	(box box1) (at box1 node2-2) (locked box1) (box-color box1 green)
	(key key0) (at key0 node0-2) (key-color key0 red)
	(key key1) (at key1 node0-3) (key-color key1 green)
	(hand hand0) (hand hand1) (handfree hand0) (handfree hand1)
	(at-agent node0-0)
)

(:goal (and (open box0) (open box1) (at-agent node0-0)))	


)

; plan
1. (move node0-0 node0-1)
   deleted: (at-agent node0-0)
   added: (at-agent node0-1)
   goals met: 0 of 3
2. (move node0-1 node0-2)
   deleted: (at-agent node0-1)
   added: (at-agent node0-2)
   goals met: 0 of 3
3. (move node0-2 node0-3)
   deleted: (at-agent node0-2)
   added: (at-agent node0-3)
   goals met: 0 of 3
4. (pickup node0-3 key1 hand1)
   deleted: (at key1 node0-3) (handfree hand1)
   added: (holding key1 hand1)
   goals met: 0 of 3
5. (move node0-3 node0-2)
   deleted: (at-agent node0-3)
   added: (at-agent node0-2)
   goals met: 0 of 3
6. (pickup node0-2 key0 hand0)
   deleted: (at key0 node0-2) (handfree hand0)
   added: (holding key0 hand0)
   goals met: 0 of 3
7. (move node0-2 node1-2)
   deleted: (at-agent node0-2)
   added: (at-agent node1-2)
   goals met: 0 of 3
8. (move node1-2 node2-2)
   deleted: (at-agent node1-2)
   added: (at-agent node2-2)
   goals met: 0 of 3
9. (unlock node2-2 key1 box1 green hand1)
   deleted: (holding key1 hand1) (locked box1)
   added: (handfree hand1) (open box1)
   goals met: 1 of 3
10. (move node2-2 node1-2)
   deleted: (at-agent node2-2)
   added: (at-agent node1-2)
   goals met: 1 of 3
11. (move node1-2 node1-1)
   deleted: (at-agent node1-2)
   added: (at-agent node1-1)
   goals met: 1 of 3
12. (unlock node1-1 key0 box0 red hand0)
   deleted: (holding key0 hand0) (locked box0)
   added: (handfree hand0) (open box0)
   goals met: 2 of 3
13. (move node1-1 node1-0)
   deleted: (at-agent node1-1)
   added: (at-agent node1-0)
   goals met: 2 of 3
14. (move node1-0 node0-0)
   deleted: (at-agent node1-0)
   added: (at-agent node0-0)
   goals met: 3 of 3
